% 译码函数decoder,传入一个七维行向量（只含01），返回其对应的数字符（0到9）
function y = decoder(vec)
    % 将向量字符串化
    str = '';
    for i = 1 : 7
        ch = num2str(vec(i));
        str = strcat(str,ch);
    end
    
    switch str
        % 数字0
        case {'0001101','0100111','1110010'}
            y = 0;
        % 数字1
        case {'0011001','0110011','1100110'}
            y = 1;
        % 数字2
        case {'0010011','0011011','1101100'}
            y = 2;
        % 数字3
        case {'0111101','0100001','1000010'}
            y = 3;
        % 数字4
        case {'0100011','0011101','1011100'}
            y = 4;
        % 数字5
        case {'0110001','0111001','1001110'}
            y = 5;
        % 数字6
        case {'0101111','0000101','1010000'}
            y = 6;
        % 数字7
        case {'0111011','0010001','1000100'}
            y = 7;
        % 数字8
        case {'0110111','0001001','1001000'}
            y = 8;
        % 数字9
        case {'0001011','0010111','1110100'}
            y = 9;
        otherwise
            fprintf("【ERROR】\n无法识别数字符！原输入字符为：%s\n",str);
            y = -1;
    end
end
